//Задание 1
// const numbs = [1, 5, 4, 10, 0, 3];
// for (let i = 0; i < numbs.length; i++) {
//	if (numbs[i] == 10) 
//     break;
// 	console.log(numbs[i]);
// }


//Задание 2
// Дан массив: [1, 5, 4, 10, 0, 3].
// Найдите позицию числа 4 в этом массиве.
//const exercise = [1, 5, 4, 10, 0, 3];
//console.log(exercise[2]);


const numbs = [2, 4, 5, 6, 8];

for (let i = 0; i < numbs.length; i++) {
	console.log(numbs[i]);
}

//Задание 3
// let exits = [1, 3, 5, 10, 20];
// exits = exits.join(' ');
// console.log(exits);


//Задание 4
// С помощью вложенных циклов создайте многомерный массив вида: 
// [[1, 1, 1], [1, 1, 1], [1, 1, 1]].

//Задание 5
// Дан массив: [1, 1, 1].
// Добавьте в конец массива значения 2, 2, 2.

//Задание 6
// Дан массив: [9, 8, 7, 'a', 6, 5].
// С помощью метода sort отсортируйте массив и удалите букву 'a' из данного массива. 
// В результате работы программы вывести массив, состоящий из цифр.

//Задание 7
// Дан массив:[9, 8, 7, 6, 5].
// Пользователь с клавиатуры вводит число от 1 до 10 (использовать prompt()
// ). Необходимо проверить, содержится ли введенное пользователем число в данном массиве.